{
    "poems": [
      {
        "id": 1,
        "lines": [
          "In your eyes, Vidya, I find my shyness,",
          "Tears of joy from your eyes, like pearls divine,",
          "I'll cherish them in my heart's sacred shrine."
        ]
      },
      {
        "id": 2,
        "lines": [
          "When you wear the necklace of joyous pearls, Vidya,",
          "My eyes too shall weep tears of bliss,",
          "I'll be the shore to your ocean of happiness."
        ]
      },
      {
        "id": 3,
        "lines": [
          "My love for you, Vidya, will transcend all bounds,",
          "No calamity can break this bond profound,",
          "I'll sacrifice my life, yet keep you safe and sound."
        ]
      },
      {
        "id": 4,
        "lines": [
          "Love isn't just roses on special days, Vidya,",
          "It's the beating heart, fervently at bay,",
          "Drenched in love's dreams day by day."
        ]
      },
      {
        "id": 5,
        "lines": [
          "My heart blooms at the sight of you, Vidya,",
          "A smile on my face, tranquility in view,",
          "Lost in love's dreams, forever anew."
        ]
      },
      {
        "id": 6,
        "lines": [
          "The day you entered my life, Vidya, it overflowed,",
          "Like ending a long journey, a new episode,",
          "Your love gave me a purpose, a code."
        ]
      },
      {
        "id": 7,
        "lines": [
          "I love you immensely, Vidya, with every beat,",
          "Each breath feels your love's heat,",
          "Every word, a call to love, complete."
        ]
      },
      {
        "id": 8,
        "lines": [
          "I promise to keep your happiness intact, Vidya,",
          "My every heartbeat longs for your pact,",
          "Tears of joy from my eyes, a love fact."
        ]
      },
      {
        "id": 9,
        "lines": [
          "Your touch ignites a path within, Vidya,",
          "My soul dances in love's spin,",
          "With you, every moment's a win."
        ]
      },
      {
        "id": 10,
        "lines": [
          "Holding you, Vidya, our hearts connect,",
          "Beat by beat, our love reflects,",
          "A bond that nothing can ever affect."
        ]
      },
      {
        "id": 11,
        "lines": [
          "Your love, Vidya, a treasure beyond compare,",
          "In every breath, I find you there,",
          "With you, life's burdens I can bear."
        ]
      },
      {
        "id": 12,
        "lines": [
          "Embracing you, Vidya, life feels complete,",
          "Our love, a bond no one can defeat,",
          "Forever together, our hearts beat."
        ]
      },
      {
        "id": 13,
        "lines": [
          "Through embraces, Vidya, our souls unite,",
          "Love's radiance, a heavenly light,",
          "In your arms, everything feels right."
        ]
      },
      {
        "id": 14,
        "lines": [
          "Each embrace, Vidya, a love story retold,",
          "Two hearts entwined, a love so bold,",
          "In your warmth, my world unfolds."
        ]
      },
      {
        "id": 15,
        "lines": [
          "Your embrace, Vidya, a symphony of love's grace,",
          "In your arms, I find my place,",
          "Forever yours, in love's embrace."
        ]
      },
      {
        "id": 16,
        "lines": [
          "Love's embrace, Vidya, a sanctuary divine,",
          "Your touch, like poetry in every line,",
          "With you, my heart's forever entwined."
        ]
      },
      {
        "id": 17,
        "lines": [
          "Your embrace, Vidya, a melody of love's sweet song,",
          "In your embrace, I belong,",
          "With you, my love grows strong."
        ]
      },
      {
        "id": 18,
        "lines": [
          "Each embrace, Vidya, a chapter of our love's story,",
          "Two souls intertwined, in love's glory,",
          "In your arms, I find my sanctuary."
        ]
      },
      {
        "id": 19,
        "lines": [
          "Your embrace, Vidya, a symphony of love's refrain,",
          "In your arms, all sorrows wane,",
          "Forever with you, love's eternal gain."
        ]
      },
      {
        "id": 20,
        "lines": [
          "Each embrace, Vidya, a testament of our love,",
          "Two hearts united, like stars above,",
          "In your arms, I find solace enough."
        ]
      },
      {
        "id": 21,
        "lines": [
          "Your embrace, Vidya, a canvas of love's art,",
          "In your embrace, I find my heart,",
          "Forever yours, never to depart."
        ]
      },
      {
        "id": 22,
        "lines": [
          "In your arms, Vidya, my dreams renew,",
          "Forever together, me and you."
        ]
      }
    ]
  }
  